In [21]:
import pandas as pd

In [22]:
# creating series in pandas
data = [1,2,3,4,5]
series = pd.Series(data, index = ["A", "B", "C", "D", "E"])
print(series)

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [23]:
# Creating dataframe in pandas
data = {"Name":["Kushal", "Elon", "Jeff", "Richard", "Lary"],
       "Age":[20, 58, 62, 74, 57],
       "Fav_color":["Blue", "Pink", "Green", "White", "Yellow" ]}
df = pd.DataFrame(data)
print(df)

      Name  Age Fav_color
0   Kushal   20      Blue
1     Elon   58      Pink
2     Jeff   62     Green
3  Richard   74     White
4     Lary   57    Yellow

## Data Tranformation: Grouping, Merging Concatenating

In [24]:
# Group by
data = {"Name":["Kushal", "Elon", "Jeff", "Richard", "Lary"],
       "Age":[20, 58, 62, 74, 57],
       "Country":["India", "USA", "Australia", "India", "Japan" ]}
df = pd.DataFrame(data)
grouped_data = df.groupby(['Country'])
print(grouped_data['Age'].mean())

Country
Australia    62.0
India        47.0
Japan        57.0
USA          58.0
Name: Age, dtype: float64

In [25]:
# Merging
data1 = {"Name":["Kushal", "Elon", "Jeff", "Richard", "Lary"],
       "Age":[20, 58, 62, 74, 57]}
data2= {"Name":["Kushal", "Elon", "Jeff", "Richard", "Lary"],
       "Fav_color":["Blue", "Pink", "Green", "White", "Yellow" ]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
merged_data = pd.merge(df1, df2, on='Name')
print(merged_data)

      Name  Age Fav_color
0   Kushal   20      Blue
1     Elon   58      Pink
2     Jeff   62     Green
3  Richard   74     White
4     Lary   57    Yellow

In [26]:
# Concatenate
data1 = {"Name":["Kushal", "Elon", "Jeff"],
       "Age":[20, 58, 62]}
data2= {"Name":["Richard", "Lary"],
       "Age":[74, 57]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
concatenatedData = pd.concat([df1,df2], axis=0)
print(concatenatedData)

      Name  Age
0   Kushal   20
1     Elon   58
2     Jeff   62
0  Richard   74
1     Lary   57

### Sorting, Filtering & Mapping the data

In [27]:
# Creating dataframe in pandas
data = {"Name":["Kushal", "Elon", "Jeff", "Richard", "Lary"],
       "Math":[98, 58, 62, 74, 57],
       "English":[87, 89, 70, 93, 45 ],
       "DSA":[89, 79, 80, 100, 91 ]}
df = pd.DataFrame(data, index=[1,2,3,4,5])
df

      Name  Math  English  DSA
1   Kushal    98       87   89
2     Elon    58       89   79
3     Jeff    62       70   80
4  Richard    74       93  100
5     Lary    57       45   91

In [28]:
# Sort
ageSortedData = df.sort_values(by=['English'], ascending=False)
print(ageSortedData)
print("\n")
data_s = df.sort_values(by=['Math', 'English'], ascending=[True, False])
print(data_s)

      Name  Math  English  DSA
4  Richard    74       93  100
2     Elon    58       89   79
1   Kushal    98       87   89
3     Jeff    62       70   80
5     Lary    57       45   91


      Name  Math  English  DSA
5     Lary    57       45   91
2     Elon    58       89   79
3     Jeff    62       70   80
4  Richard    74       93  100
1   Kushal    98       87   89

In [29]:
# Filtered Data
# booleean Filtering
filtered_data = df[df['Math'] > 60]
print(filtered_data)

print("\n")
# Multiple Conditions
filteredData = df[(df['Math'] > 60)&(df['English'] > 85)]
print(filteredData)

      Name  Math  English  DSA
1   Kushal    98       87   89
3     Jeff    62       70   80
4  Richard    74       93  100


      Name  Math  English  DSA
1   Kushal    98       87   89
4  Richard    74       93  100

In [30]:
# Mapping
mapped = {"Kushal":3, "Elon":1, "Jeff":0, "Richard":2, "Lary":1}
df['profeciency'] = df['Name'].map(mapped)
df

      Name  Math  English  DSA  profeciency
1   Kushal    98       87   89            3
2     Elon    58       89   79            1
3     Jeff    62       70   80            0
4  Richard    74       93  100            2
5     Lary    57       45   91            1

### Indexing and slicing

In [31]:
# loc and iloc
print(df.loc[1, 'Name'])

print("\n")

print(df.iloc[0, 0])

Kushal


Kushal

In [35]:
# Slicing
print(df[1:3])

print("\n")

print(df.loc[1:3, ['Name', 'Math']])

   Name  Math  English  DSA  profeciency
2  Elon    58       89   79            1
3  Jeff    62       70   80            0


     Name  Math
1  Kushal    98
2    Elon    58
3    Jeff    62